Document_Logging_V2/src/test/resources/sample_data/envelope.xml

<soapenv:Envelope
    xmlns:com="http://www.capita.co.uk/clps/schema/v1.0/commonservice"
    xmlns:doc="http://www.capita.co.uk/clps/schema/v1.0/documentloggingschema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
    <soapenv:Header>
        <com:Identification>
            <!--Optional:-->
            <com:UsernameToken>HiteshR</com:UsernameToken>
            <com:clientAccount>FriendsLife</com:clientAccount>
            <com:partnerName>Not_APPLICABLE</com:partnerName>
            <com:requestDate>2018-04-03T10:36:01</com:requestDate>
            <com:instanceID>NA</com:instanceID>
            <com:environment>UAT</com:environment>
        </com:Identification>
    </soapenv:Header>
    <soapenv:Body>
        <doc:insertLogRequest>
            <!--Optional:-->
            <doc:insertLogRequestList>
                <!--1 or more repetitions:-->
                <doc:insertLogRequestItem>
                    <doc:companyCode>FL</doc:companyCode>
                    <doc:guid>58633394dd114377bdb8def9125c1c7d</doc:guid>
                    <doc:date>2018-04-03T10:36:01</doc:date>
                    <doc:stage>700</doc:stage>
                    <!--Optional:-->
                    <doc:finalStage>900</doc:finalStage>
                    <doc:letterID>114377bdb8def9125c1c7d</doc:letterID>
                    <doc:capitaLetterID>CAP114377bdb8def9125c1c7d</doc:capitaLetterID>
                    <!--Optional:-->
                    <doc:policyNumber>BA1000758</doc:policyNumber>
                    <!--Optional:-->
                    <doc:customerName>TestCustomer</doc:customerName>
                </doc:insertLogRequestItem>
            </doc:insertLogRequestList>
        </doc:insertLogRequest>
    </soapenv:Body>
</soapenv:Envelope>
