Document_Logging_V2/src/main/resources/examples/AVIVA Example.xml

<SOAP:Envelope xmlns:SOAP="http://schemas.xmlsoap.org/soap/envelope/">
	<SOAP:Header>
		<com:Identification xmlns:com="http://www.capita.co.uk/clps/schema/v1.0/commonservice">
			<com:clientAccount>FriendsLife</com:clientAccount>
			<com:environment>PROD</com:environment>
		</com:Identification>
	</SOAP:Header>
	<SOAP:Body>
		<updateLogRequest xmlns="http://www.capita.co.uk/clps/schema/v1.0/documentloggingschema" xmlns:SOAP="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
			<updateLogRequestList>
				<updateLogRequestItem>
				<guid>58633394dd114377bdb8def9125c1c7d</guid>
				<capitaLetterID/>
				<date>2018-04-03T10:36:01</date>
				<stage>700</stage>
			</updateLogRequestItem>
			<updateLogRequestItem>
				<guid>3ca50f8ec7d6458183c129a99d5e00d7</guid>
				<capitaLetterID/>
				<date>2018-04-03T10:36:01</date>
				<stage>700</stage>
			</updateLogRequestItem>
			<updateLogRequestItem>
				<guid>54535d19a2ef49f493519d5c80311d28</guid>
				<capitaLetterID/>
				<date>2018-04-03T10:36:01</date>
				<stage>700</stage>
			</updateLogRequestItem>
			<updateLogRequestItem>
				<guid>d7f2ef09023448caa37996f691d9cdcf</guid>
				<capitaLetterID/>
				<date>2018-04-03T10:36:01</date>
				<stage>700</stage>
			</updateLogRequestItem>
			<updateLogRequestItem>
				<guid>ac0e1e070d8f42598a99e3e1ad154828</guid>
				<capitaLetterID/>
				<date>2018-04-03T10:36:01</date>
				<stage>700</stage>
			</updateLogRequestItem>
			<updateLogRequestItem>
				<guid>040d1e4c7c924c20b08440634a4c62da</guid>
				<capitaLetterID/>
				<date>2018-04-03T10:36:01</date>
				<stage>700</stage>
			</updateLogRequestItem>
			<updateLogRequestItem>
				<guid>65ad9cf725484235b8b161defc8905e4</guid>
				<capitaLetterID/>
				<date>2018-04-03T10:36:01</date>
				<stage>700</stage>
			</updateLogRequestItem>
			<updateLogRequestItem>
				<guid>d72cfa8f7f074879b5703f80e4ea1f72</guid>
				<capitaLetterID/>
				<date>2018-04-03T10:36:01</date>
				<stage>700</stage>
			</updateLogRequestItem>
			<updateLogRequestItem>
				<guid>66f599b8908c4eef8a37e25c92f36b11</guid>
				<capitaLetterID/>
				<date>2018-04-03T10:36:01</date>
				<stage>700</stage>
			</updateLogRequestItem>
			<updateLogRequestItem>
				<guid>5d801d08ba114e56b90919f5d9a7b5e2</guid>
				<capitaLetterID/>
				<date>2018-04-03T10:36:01</date>
				<stage>700</stage>
			</updateLogRequestItem>
			<updateLogRequestItem>
				<guid>0cc057b7f3e2461c81a2477164d685e0</guid>
				<capitaLetterID/>
				<date>2018-04-03T10:36:01</date>
				<stage>700</stage>
			</updateLogRequestItem>
			<updateLogRequestItem>
				<guid>d38c868935ff4dbe847bf50a405e8832</guid>
				<capitaLetterID/>
				<date>2018-04-03T10:36:01</date>
				<stage>700</stage>
			</updateLogRequestItem>
			<updateLogRequestItem>
				<guid>7192b2cbff5b46f890c0de3d8861e22d</guid>
				<capitaLetterID/>
				<date>2018-04-03T10:36:01</date>
				<stage>700</stage>
			</updateLogRequestItem>
			</updateLogRequestList>
		</updateLogRequest>
	</SOAP:Body>
</SOAP:Envelope>
